Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Same as IsAlpha except that integers and characters 0 through 9 are also allowed.
ja: 整数および0から9までの文字も許容することを除いて、IsAlphaと同じ。

source: Same as IsDigit except the characters A through F (uppercase or lowercase) are also allowed.
ja: A～Fの文字（大文字、小文字）も使用できる以外は、IsDigitと同じです。

source: Same as WinActivate except that it activates the bottommost matching window rather than the topmost.
ja: WinActivateと同じですが、一番上のウィンドウではなく、一番下のマッチングウィンドウをアクティブにすることを除いては、同じです。

source: Same as TBS_TOP.
ja: TBS_TOPと同じ。

source: Same as digit except the characters A through F (uppercase or lowercase) are also allowed.
ja: A～Fの文字（大文字、小文字）も使用できる以外は、digitと同じです。

source: Same as CaseLocale except that any sequences of digits in the text are treated as true numbers rather than mere characters.
ja: CaseLocaleと同じですが、テキスト中の数字列が単なる文字ではなく、真の数字として扱われる点が異なります。

source: Same as above but for an explicitly named directory.
ja: 上記と同じですが、明示的に名前を付けたディレクトリの場合です。

source: Same as above but in descending order.
ja: 上記と同じだが、降順。

source: Same as above but with corners rounded to 40x40.
ja: 上記と同じだが、角が40x40に丸くなっている。

source: Same as above except for the previous hotkey.
ja: 前のホットキーを除き、上記と同じ。

source: Same as above except it is done by position instead of name.
ja: 名前ではなく役職で行う以外は上記と同じです。

source: Same as above except move backward in the menu.
ja: メニューの後方に移動する以外は、上記と同じです。

source: Same as above except that rather than falling back to Event mode when SendInput is unavailable, it reverts to Play mode (below).
ja: SendInputが使用できない場合にEventモードに戻るのではなく、Playモード（下記）に戻る点を除き、上記と同じ。

source: Same as above except that this hotkey is inactive (due to being unsupported, disabled, or suspended).
ja: このホットキーが非アクティブ（非対応、無効、または停止中であるため）であることを除いて、上記と同じです。

source: Same as above, but you are assigning a value of a variable to another variable.
ja: 上記と同じだが、変数の値を別の変数に代入している。

source: Same as calling SetWorkingDir.
ja: SetWorkingDirを呼び出すのと同じです。

source: Same as for the Click event.
ja: クリックイベントと同じです。

source: Same as the WS_SIZEBOX style.
ja: WS_SIZEBOXスタイルと同じ。

source: Same as the WS_THICKFRAME style.
ja: WS_THICKFRAMEスタイルと同じ。

source: Same as the WS_TILED style.
ja: WS_TILEDスタイルと同じ。

source: Same as the WS_TILEDWINDOW style.
ja: WS_TILEDWINDOWスタイルと同じ。

source: Same as the previous control's left edge (XP).
ja: 前のコントロールの左端（XP）と同じです。

source: Same as the previous control's left edge (xp).
ja: 前のコントロールの左端（xp）と同じです。

source: Same as the previous control's top edge (YP).
ja: 前コントロールのトップエッジ（YP）と同じです。

source: Same as the previous control's top edge (yp).
ja: 前コントロールのトップエッジ（yp）と同じです。

source: Same effect as the above because "Screen" is the default.
ja: Screen」がデフォルトであるため、上記と同じ効果です。

source: Same parameters as above.
ja: 上記と同じパラメータです。

source: Same with hotkeys.
ja: ホットキーも同じです。

source: Save dialog.
ja: 保存ダイアログです。

source: Save it as a small file for use with ImageSearch.
ja: ImageSearchで使用するために小さなファイルとして保存してください。

source: Save settings
ja: 設定の保存

source: Save the File.
ja: ファイルを保存する。

source: Save the current clipboard contents to be
ja: 現在のクリップボードの内容を保存して

source: Save the following script as Receiver.ahk then launch it.
ja: 以下のスクリプトをReceiver.ahkとして保存し、起動してください。

source: Save the following script as Sender.ahk then launch it.
ja: 以下のスクリプトをSender.ahkとして保存し、起動してください。

source: Save the script as UTF-8, preferably with BOM.
ja: スクリプトの文字コードをUTF-8、できればBOM付きで保存してください。

source: Save the script as UTF-8.
ja: スクリプトをUTF-8で保存します。

source: Saved := MyGui.Submit() ; Save the contents of named controls into an object.
ja: Saved := MyGui.Submit() ; 名前付きコントロールの内容を、オブジェクトに保存します。

source: Saves and restores everything on the clipboard using a file.
ja: クリップボードにあるすべてのものを、ファイルを使って保存・復元します。

source: Saves and restores everything on the clipboard using a variable.
ja: 変数を使ってクリップボードのすべてを保存・復元します。

source: SayHello ; Call the SayHello function.
ja: SayHello ; SayHello関数を呼び出す。

source: SayHello() ; Define the SayHello function.
ja: SayHello() ; SayHello関数を定義します。

source: SciTE4AutoHotkey can be found here:
ja: SciTE4AutoHotkeyはこちらにあります：

source: SciTE4AutoHotkey can be found here: https://www.autohotkey.com/scite4ahk/
ja: SciTE4AutoHotkeyはこちらにあります：https://www.autohotkey.com/scite4ahk/

source: SciTE4AutoHotkey is a custom version of the text editor known as SciTE.
ja: SciTE4AutoHotkeyは、SciTEとして知られるテキストエディタのカスタムバージョンです。

source: SciTE4AutoHotkey is simple to install, relatively light-weight, and fully supports AutoHotkey v1 and v2 without further configuration.
ja: SciTE4AutoHotkeyはインストールが簡単で、比較的軽量、さらに設定することなくAutoHotkey v1およびv2を完全にサポートします。

source: Scientific notation can be used without a decimal point (but produces a floating-point number anyway).
ja: 科学的記数法は、小数点以下がなくても使用可能です（ただし、いずれにせよ浮動小数点数を生成します）。

source: Scientific notation is also recognized (e.g. 1.0e4 and -2.1E-4), but always produces a floating-point number even if no decimal point is present.
ja: 科学表記も認識されるが（例：1.0e4 、-2.1E-4）、小数点以下がない場合でも常に浮動小数点数の数値が生成されます。

source: Scientific notation is also supported when numeric strings are converted to integers (for example, "1e3" is interpreted as 1000 instead of 1).
ja: 数値文字列を整数に変換する際、科学的表記もサポートされます（例えば、"1e3"は1ではなく1000と解釈されます）。

source: Scope
ja: スコープ

source: Script Compiler Directives
ja: スクリプト・コンパイラ・ディレクティブ

source: Script Compiler Directives | AutoHotkey v2
ja: スクリプトコンパイラディレクティブ｜AutoHotkey v2

source: Script File Codepage
ja: スクリプトファイルのコードページ

source: Script Library Folders
ja: スクリプトライブラリフォルダ

source: Script Performance
ja: スクリプト・パフォーマンス

source: Script Performance | AutoHotkey v2
ja: スクリプトパフォーマンス｜AutoHotkey v2

source: Script Properties
ja: スクリプト・プロパティ

source: Script Properties:
ja: スクリプトのプロパティ：

source: Script Properties: command line parameters, A_WorkingDir, A_ScriptDir, A_ScriptName, (...more...)
ja: スクリプトのプロパティ：コマンドラインパラメータ、A_WorkingDir、A_ScriptDir、A_ScriptName、(...もっと...)

source: Script Settings
ja: スクリプト設定

source: Script Settings:
ja: スクリプトの設定：

source: Script Settings: A_IsSuspended, A_ListLines, A_TitleMatchMode, (...more...)
ja: スクリプトの設定：A_IsSuspended、A_ListLines、A_TitleMatchMode、(...もっと...)

source: Script Showcase
ja: スクリプト・ショーケース

source: Script Showcase | AutoHotkey v2
ja: スクリプトショーケース｜AutoHotkey v2

source: Script Startup (the Auto-execute Thread)
ja: スクリプトの起動（自動実行スレッド）

source: Script authors should not invoke this mechanism explicitly, except when dealing directly with unmanaged pointers to objects.
ja: アンマネージドなオブジェクトへのポインターを直接扱う場合を除き、スクリプト作成者はこのメカニズムを明示的に呼び出すべきではない。

source: Script compiler directives allow the user to specify details of how a script is to be compiled via Ahk2Exe.
ja: スクリプトコンパイラディレクティブにより、Ahk2Exeで、どのようにスクリプトをコンパイルするかの詳細を指定することができます。

source: Script compiler directives allow the user to specify details of how a script is to be compiled.
ja: スクリプトコンパイラディレクティブは、スクリプトのコンパイル方法の詳細を指定します。

source: Script-based Clients
ja: スクリプトベースクライアント

source: Scripting Language
ja: スクリプト言語

source: Scripting Language | AutoHotkey v2
ja: スクリプト言語｜AutoHotkey v2

source: Scripts
ja: スクリプト

source: Scripts - Definition & Usage | AutoHotkey v2
ja: スクリプト - 定義と使用法｜AutoHotkey v2

source: Scripts are "persistent" while at least one of the following conditions is satisfied:
ja: スクリプトは、以下の条件のうち少なくとも1つが満たされている間、「永続的」です：

source: Scripts are also forced to exit when Windows shuts down.
ja: Windowsをシャットダウンするとスクリプトも強制終了します。

source: Scripts are no longer automatically included from the function library (Lib) folders when a function call is present without a definition, due to increased complexity and potential for accidents (now that the MyFunc in MyFunc() can be any variable).
ja: スクリプトは、関数呼び出しが定義なしで存在する場合、複雑さと事故の可能性のため、関数ライブラリ（Lib）フォルダから自動的に含まれなくなりました（MyFunc()のMyFuncが任意の変数になることができるようになりました）。

source: Scripts are not required to follow this convention, and can use any valid function name.
ja: スクリプトはこの規約に従う必要はなく、任意の有効な関数名を使用することができます。

source: Scripts are often (perhaps usually) written without error-checking, so the policy of setting ErrorLevel for errors often let them go undetected.
ja: スクリプトはエラーチェックをせずに書かれることが多いので（おそらく通常）、エラーにErrorLevelを設定する方針では、エラーが検出されないことがよくあります。

source: Scripts can also be compiled; that is, combined together with an AutoHotkey binary file to form a self-contained executable (.exe) file.
ja: スクリプトはコンパイルすることもできます。つまり、AutoHotkeyのバイナリファイルと組み合わせて、自己完結型の実行ファイル（.exe）を作成します。

source: Scripts can be commented by using a semicolon at the beginning of a line.
ja: スクリプトは、行頭のセミコロンでコメントすることができます。

source: Scripts can be pinned for easy access.
ja: スクリプトは簡単にアクセスできるようにピン留めできます。

source: Scripts can call super.__xxx() if needed.
ja: スクリプトは必要に応じてsuper.__xxx()を呼び出すことができます。

source: Scripts can define a class which extends Gui and handles its own events, keeping all of the GUI logic self-contained.
ja: スクリプトは、Guiを拡張し、独自のイベントを処理するクラスを定義することができ、すべてのGUIロジックを自己完結させることができます。

source: Scripts cannot rely on an item receiving a particular ID, but can retrieve the ID of an item by using GetMenuItemID as shown in example #5.
ja: スクリプトは、アイテムが特定のIDを受け取ることに依存することはできませんが、例5で示すようにGetMenuItemIDを使用して、アイテムのIDを取得することができます。

source: Scripts containing hotstrings are automatically persistent.
ja: ホットストリングを含むスクリプトは自動的に永続化されます。

source: Scripts do not free objects explicitly.
ja: スクリプトは明示的にオブジェクトを解放しない。

source: Scripts interact with an object only indirectly, through a reference to the object.
ja: スクリプトは、オブジェクトへの参照を通じて、間接的にのみオブジェクトと対話します。

source: Scripts may be embedded into a standard AutoHotkey .exe file by adding them as Win32 (RCDATA) resources using the Ahk2Exe compiler.
ja: スクリプトは、Ahk2Exeコンパイラを使用してWin32（RCDATA）リソースとして追加することで、標準のAutoHotkey .exeファイルに埋め込むことができます。

source: Scripts may determine if a value is a ComObjArray as follows:
ja: スクリプトは、以下のように値がComObjArrayであるかどうかを判断することができる：

source: Scripts may now use the NIIF_USER (0x4) and NIIF_LARGE_ICON (0x20) flags in combination (0x24) to include the large version of the tray icon in the notification.
ja: スクリプトは、NIIF_USER (0x4) と NIIF_LARGE_ICON (0x20) フラグを組み合わせて (0x24) 使用し、トレイアイコンの大きいバージョンを通知に含めることができるようになります。

source: Scripts may use the full name or just the leading part of the name, such as "Mic" or "Microphone".
ja: スクリプトは、完全な名前を使用することも、「Mic」や「Microphone」のように名前の先頭部分だけを使用することもできる。

source: Scripts read from stdin (e.g. with AutoHotkey.exe *) no longer include the initial working directory in A_ScriptFullPath or the main window's title, but it is used as A_ScriptDir and to locate the local Lib folder.
ja: 標準入力から読み込まれるスクリプト（例：AutoHotkey.exe *）は、A_ScriptFullPathやメインウィンドウのタイトルに初期作業ディレクトリを含めなくなりましたが、A_ScriptDirとして、またローカルLibフォルダを探すために使用されます。

source: Scripts relying on the two variable mode to retrieve methods would then miss some methods.
ja: 2変数モードでメソッドを取得するスクリプトは、いくつかのメソッドを見逃すことになります。

source: Scripts should not rely on this:
ja: スクリプトはこれに依存しないようにしてください：

source: Scripts should not rely on this: If the error was raised by a built-in function, continuing causes it to return "".
ja: スクリプトはこれに依存しないようにしてください：エラーが組み込み関数によって発生した場合、その関数を継続すると""が返されます。

source: Scripts support command line parameters.
ja: スクリプトはコマンドラインパラメーターをサポートする。

source: Scripts that are executed by selecting a custom tray menu item.
ja: カスタムトレイのメニュー項目を選択することで実行されるスクリプトです。

source: Scripts that do not contain this directive use a 1000 ms timeout.
ja: このディレクティブを含まないスクリプトは、1000msのタイムアウトを使用します。

source: Scripts using structures or DllCalls may need to account for this to run correctly on both platforms.
ja: 構造体やDllCallを使用するスクリプトは、両方のプラットフォームで正しく実行するために、これを考慮する必要があります。

source: Scripts which create or retrieve COM objects and use ComObjConnect to respond to the object's events.
ja: COMオブジェクトを作成または取得し、オブジェクトのイベントに応答するためにComObjConnectを使用するスクリプトです。

source: Scripts which need to run other scripts with UI access can simply Run the appropriate UIA.exe file with the normal command line parameters.
ja: UIアクセスで他のスクリプトを実行する必要があるスクリプトは、適切なUIA.exeファイルを通常のコマンドラインパラメータで実行するだけです。

source: Scripts which require a pure boolean value (0 or 1) can use something like !!(x or y) or (x or y) ? 1 : 0.
ja: 純粋なブール値（0または1）を必要とするスクリプトでは、!!(x or y)または(x or y) ? 1 : 0を使うことができます。

source: Scripts which use OnMessage or CallbackCreate and DllCall to respond to events, since those functions don't make the script persistent.
ja: OnMessageや CallbackCreate、DllCallを使用してイベントに応答するスクリプトは、これらの関数がスクリプトを永続化しないためです。

source: Scripts work a little differently.
ja: スクリプトはちょっと違うんです。

source: Scripts:
ja: スクリプト：

source: Scroll down to the bottom of the page.
ja: ページ下部までスクロールしてください。

source: Scroll to the left or right.
ja: 左右にスクロールします。

source: Scrolling is disabled.
ja: スクロールは無効。

source: Scrolls down by one line (for a control that has a vertical scroll bar).
ja: 1行分スクロールダウンします（垂直スクロールバーを持つコントロールの場合）。

source: Scrolls text up one page when the user presses Enter on the last line.
ja: 最後の行でEnterキーを押すと、テキストを1ページ分上にスクロールする。

source: Scrolls up by one line (for a control that has a vertical scroll bar).
ja: 1行分スクロールアップします（垂直スクロールバーを持つコントロールの場合）。

source: Search
ja: 検索

source: Searches a region of the active window for a pixel and stores in Px and Py the X and Y coordinates of the first pixel that matches the specified color with 3 shades of variation.
ja: アクティブウィンドウの領域をピクセルで検索し、指定された色に3階調のバリエーションで一致する最初のピクセルのXとY座標をPxと Pyに格納します。

source: Searches a region of the active window for an image and stores in FoundX and FoundY the X and Y coordinates of the upper-left pixel of where the image was found.
ja: アクティブウィンドウの画像領域を検索し、画像が見つかった場所の左上ピクセルのX座標とY座標をFoundXと FoundYに格納します。

source: Searches a region of the screen for a pixel of the specified color.
ja: 指定された色のピクセルを画面上の領域で検索します。

source: Searches a region of the screen for an image and stores in FoundX and FoundY the X and Y coordinates of the upper-left pixel of where the image was found, including advanced error handling.
ja: 高度なエラー処理を含め、画面の領域を画像検索し、画像が見つかった場所の左上ピクセルのXおよびY座標をFoundXおよびFoundYに格納します。

source: Searches a region of the screen for an image.
ja: 画面内の領域を検索して画像を探します。

source: Searches for Needle in Haystack.
ja: HaystackをNeedleで探します。

source: Searches for a given occurrence of a string, from the left or the right.
ja: 文字列の左または右から、指定された出現箇所を検索します。

source: Searching...
ja: 検索中……

source: Secondary mouse button.
ja: マウスの第2ボタン。

source: Seconds with leading zero (00 – 59)
ja: 秒数（先頭のゼロあり）（00～59）

source: Seconds without leading zero (0 – 59)
ja: 秒数（先頭のゼロなし）（0～59）

source: Seconds, Minutes, Hours or Days.
ja: Seconds, Minutes, Hours または Days.

source: Security Prompts
ja: セキュリティプロンプト

source: See #ErrorStdOut for details.
ja: 詳細は#ErrorStdOutを参照。

source: See #HotIf for details.
ja: 詳しくは「#HotIf」をご覧ください。

source: See A_IsCritical for how to save and restore the current setting of Critical.
ja: 現在のCriticalの設定を保存・復元する方法については、A_IsCriticalを参照してください。

source: See Arrays and Maps for common usage.
ja: 一般的な使用法については、配列と マップを参照のこと。

source: See Automating Winamp.
ja: Winampの自動化を参照してください。

source: See Binary Compatibility for equivalent Win32 types and other details.
ja: 同等のWin32型などについては、「バイナリ互換性」を参照してください。

source: See Built-in Classes for a list of standard object types.
ja: 標準的なオブジェクト・タイプのリストについては、組み込みクラスを参照のこと。

source: See Built-in Variables for general information.
ja: 一般的な情報については、組み込み変数を参照してください。

source: See Catch below for details.
ja: 詳しくは下記のCatchをご覧ください。

source: See ComObjType for a list of possible values.
ja: 取り得る値の一覧は、ComObjTypeをご覧ください。

source: See ComObjType for a list of types.
ja: タイプの一覧はComObjTypeをご覧ください。

source: See ComValue for details.
ja: 詳しくはComValueをご覧ください。

source: See Concepts and Conventions for more general explanation of various concepts utilised by AutoHotkey.
ja: AutoHotkeyで利用される様々な概念についてのより一般的な説明については、概念と規約を参照してください。

source: See CreateFile.
ja: CreateFileを参照してください。

source: See Detecting Changes (Slider) for details.
ja: 詳しくは「変化の検出（スライダー）」をご覧ください。

source: See EnvGet example #2 for an alternative method.
ja: 別の方法については、EnvGetの例2を参照してください。

source: See Events (OnEvent) for details of all explicitly supported GUI and GUI control events.
ja: 明示的にサポートされるすべてのGUIおよびGUI制御イベントの詳細については、イベント（OnEvent）を参照してください。

source: See Events further below.
ja: 下記「イベント」をご覧ください。

source: See Expressions for a structured overview and further explanation.
ja: 構造化された概要と詳細な説明については、式をご覧ください。

source: See FileEncoding for a list of possible values.
ja: 指定できる値の一覧は、FileEncodingを参照。

source: See FileSelect for an example of how to extract the individual components from the return value.
ja: 戻り値から個々の構成要素を抽出する例については、FileSelectを参照してください。

source: See Format for how to convert it to hexadecimal.
ja: 16進数への変換方法は、「フォーマット」を参照してください。

source: See Functions for much more detail.
ja: 詳しくは機能をご覧ください。

source: See GDI+ standard library by tic.
ja: GDI+標準ライブラリby ticをご覧ください。

source: See GroupAdd for more details about window groups.
ja: ウィンドウグループの詳細については、GroupAddをご覧ください。

source: See Hotkey for examples.
ja: 例については、Hotkeyを参照してください。

source: See Loop for information about Blocks, Break, Continue, and the A_Index variable (which exists in every type of loop).
ja: ブロック、Break、Continue、A_Index変数（どのタイプのループにも存在する）については、「Loop」をご覧ください。

source: See Matching Behaviour for more details.
ja: 詳しくは「マッチング動作」をご覧ください。

source: See MenuItemName.
ja: MenuItemName」を参照。

source: See MkParseDisplayName (Microsoft Docs) for more information.
ja: 詳しくは、MkParseDisplayName (Microsoft Docs)をご覧ください。

source: See Named Function Hotkeys.
ja: 名前付き機能ホットキーを参照してください。

source: See Named Function Hotstrings.
ja: 名前付き関数ホットストリングを参照してください。

source: See OnCommand for details.
ja: 詳しくはOnCommandを参照してください。

source: See OnEvent for details.
ja: 詳しくはOnEventを参照してください。

source: See OnNotify for details.
ja: 詳しくはOnNotifyを参照してください。

source: See Operators for general information about operators.
ja: 演算子に関する一般的な情報については、「演算子」を参照してください。

source: See Options for modifiers such as i)abc, which turns off case-sensitivity in the pattern "abc".
ja: パターン "abc "の大文字小文字を区別しないi)abcなどの修飾語については、オプションを参照してください。

source: See Passing Command Line Parameters to a Script for command line usage, including a list of command line switches which affect the program's behavior.
ja: プログラムの動作に影響を与えるコマンド・ライン・スイッチのリストを含むコマンド・ラインの使用法については、スクリプトにコマンド・ライン・パラメータを渡すを参照してください。

source: See Portability of AutoHotkey.exe.
ja: AutoHotkey.exeの移植性を参照してください。

source: See RegRead example #2 for an alternative method.
ja: 別の方法は、RegReadの例2をご覧ください。

source: See Regular Expression Callouts for more info.
ja: 詳細は正規表現の吹き出しを参照。

source: See Script Compiler Directives for more details.
ja: 詳しくはスクリプト・コンパイラ・ディレクティブを参照してください。

source: See Scripting Language for details about how to write a script.
ja: スクリプトの書き方についてはスクリプト言語を参照してください。

source: See SetFormat for details.
ja: 詳しくはSetFormatを参照してください。

source: See Setup Notepad++ for AutoHotkey for instructions.
ja: 手順については、Setup Notepad++ for AutoHotkeyを参照してください。

source: See Special Keys.
ja: 特殊キー」を参照してください。

source: See Static/Class Variables (above) and Class Initialization for more detail.
ja: 詳しくは、静的/クラス変数（上）、および、クラスの初期化をご覧ください。

source: See Structure Examples for actual usages.
ja: 実際の使用方法については、「構造例」を参照してください。

source: See Try.
ja: Tryをご覧ください。

source: See Unicode vs ANSI for details.
ja: 詳しくは、Unicode vs ANSIをご覧ください。

source: See Variables for general explanation and details about how variables work.
ja: 変数がどのように機能するかについての一般的な説明と詳細については、変数をご覧ください。

source: See VisibleText for details about which keys are counted as producing text.
ja: どのキーがテキストを生成するものとしてカウントされるかの詳細については、VisibleTextを参照してください。

source: See WinTitle.
ja: WinTitleを参照してください。

source: See YYYYMMDDHH24MISS for an explanation of dates and times.
ja: 日時の説明については、YYYYMMDDHH24MISSをご覧ください。

source: See below for details.
ja: 詳しくは下記をご覧ください。

source: See continuation section for how to change these default behaviors.
ja: これらのデフォルトの動作を変更する方法については、続きのセクションを参照してください。

source: See download page of AutoHotkey.
ja: AutoHotkeyのダウンロードページをご覧ください。

source: See example #1 on the ControlShowDropDown page.
ja: ControlShowDropDown関数ページの例 1をご覧ください。

source: See example #1 on the Drive Functions page for a demonstration of this function.
ja: この関数の例はDrive関数一覧の例1 をご覧ください。

source: See example #1 on the Drive Functions page for another demonstration of this function.
ja: この関数の他の例は、「Drive関数」ページの例1をご覧ください。

source: See example #1 on the Monitor Functions page for a demonstration of this function.
ja: この関数の実例は、「Monitor関数」ページの例1をご覧ください。

source: See example #1 on the Monitor Functions page for another demonstration of this function.
ja: この機能の他の例については、モニター機能ページの例1をご覧ください。

source: See example #1 on the ProcessWait page.
ja: ProcessWaitページの例1をご覧ください。

source: See file loop and registry loop for details.
ja: 詳しくはファイルループとレジストリループを参照のこと。

source: See file-loop and registry-loop for details.
ja: 詳しくはfile-loop、registry-loopをご覧ください。

source: See file-reading loop.
ja: ファイル読み込みループ参照。

source: See general options for other options like Right, Center, and Hidden.
ja: Right、Center、Hiddenなど他のオプションについては、一般的なオプションを参照してください。

source: See parsing loop.
ja: 解析ループを参照。

source: See this page for some useful scripts.
ja: 便利なスクリプトはこちらのページを参照。

source: See this thread for background information.
ja: 背景については、このスレッドをご覧ください。

source: See Construction and Destruction.
ja: 建設と破壊をご覧ください。

source: See DllCall section further below.
ja: 後述のDllCallの項を参照。

source: See Escape Sequences for a complete list.
ja: 全リストは「エスケープシーケンス」を参照してください。

source: See File Object for a list of functions.
ja: 機能一覧は、「ファイルオブジェクト」を参照してください。

source: See InputBox for usage.
ja: 使い方はInputBoxを参照してください。

source: See Interactive Debugging for more details.
ja: 詳細については、インタラクティブデバッグをご覧ください。

source: See Known Limitations for details.
ja: 詳細は「既知の制限事項」を参照。

source: See Message Check Interval for details.
ja: 詳しくは、「メッセージチェックの間隔」を参照してください。

source: See MsgBox further below for a summary of usage.
ja: 使い方の概要は、さらに下のMsgBoxを参照してください。

source: See SendMessage further below.
ja: 後述のSendMessageを参照してください。

source: See Special Keys for details.
ja: 詳しくは特殊キーをご覧ください。

source: See Sub-Commands further below for details.
ja: 詳しくは後述の「サブコマンド」をご覧ください。

source: See Threads for details.
ja: 詳しくは「スレッド」をご覧ください。

source: See Types further above.
ja: 上記のさらに上の「タイプ」を参照してください。

source: See example #2 below.
ja: 以下の例2参照。

source: See reliability below.
ja: 以下の信頼性をご覧ください。

source: See A_Clipboard for details.
ja: 詳しくはA_Clipboardをご覧ください。

source: See Built-in Classes for a full list.
ja: 全リストは「組込クラス」をご覧ください。

source: See Critical Off for details.
ja: 詳しくはクリティカルオフをご覧ください。

source: See Critical for more details.
ja: 詳細はCriticalを参照のこと。

source: See Functions for more details.
ja: 詳細はファンクションを参照。

source: See OSError for how to get the localized error description text, or search www.microsoft.com for "system error codes" to get a list.
ja: ローカライズされたエラーの説明を取得する方法についてはOSErrorご覧ください。または、www.microsoft.com で「system error codes」を検索してリストを取得してください。

source: See Redraw for more details.
ja: 詳細は「再描画」を参照。

source: See SendPlay remapping limitations for details.
ja: 詳しくはSendPlayリマッピングの制限をご覧ください。

source: See Text mode for details.
ja: 詳しくは、「テキストモード」をご覧ください。

source: See Win functions for a list of functions which can manipulate windows or retrieve information.
ja: ウィンドウを操作したり、情報を取得したりできる関数の一覧は、Win関数を参照してください。

source: See environment variables for more details.
ja: 詳しくは、環境変数をご覧ください。

source: See #HotIf example 5.
ja: #HotIf の例5を参照してください。

source: See A_MenuMaskKey.
ja: A_MenuMaskKeyを参照。

source: See Code Page Identifiers.
ja: コードページ識別子をご覧ください。

source: See Picture control's AltSubmit section for more information about transparent images.
ja: 透過画像については、ピクチャーコントロールのAltSubmitの項を参照してください。

source: See Variable References (VarRef) for more details.
ja: 詳しくは、変数参照（VarRef）を参照してください。

source: See COM Objects (ComObject) for details.
ja: 詳細は「COMオブジェクト（ComObject）」を参照してください。

source: See object syntax.
ja: オブジェクト構文を参照のこと。

source: See FileAppend for more details.
ja: 詳細はFileAppendを参照のこと。

source: See Escape Sequences for more.
ja: 詳しくは「エスケープシーケンス」をご覧ください。

source: See WinTitle for details.
ja: 詳しくはWinTitleをご覧ください。
